"""
    print()函数用于输出内容 默认打印完以后换行
    如果不希望打印完之后换行  可以指定end参数的值 来实现打印完之后的效果
"""

print(1, end="a")
print(2, end="b")
print(3, end="c")

print("*" * 50)

s1 = "a = %d , b = %f" % (1,2.5678)
print(s1)

print("*" * 50)

s1 = "a = %d , b = %.2f" % (1,2.5678)
print(s1)

s1 = "a = %d , b = %.1f" % (1,2.5678)

print("*" * 50)

# 按照顺序填充参数到字符串中
s2 = "a = {} , b = {} , c = {}".format(10,20,True)
print(s2)

print("*" * 50)
# 按照我们指定的下标顺序 填充参数到字符串中 0表示第一个 1表示第二个 以此类推
s3 = "a = {0} , b = {2} , c = {1}".format(10,20,True)

print("*" * 50)

s4 = "a = {a1} , b = {b2} , c = {c1}".format(a1=1,b2=1,c1=2)
print(s4)

float1 = 31415.9
# : 按照后边的规则进行格式化
# *：以 * 填充空白，不写则默认以空格填充
# ^: 可选 < 、 ^ 、> , 分别对应左对齐、居中、右对齐
# 20: 数字宽度为20，数字长度不足20则进行填充
# .2f: 小数点后保留2位
str2 = "{:*^20,.2f}".format(float1)
print(str2) # *****31,415.90*****

print("*" * 50)

s5 = "字符串的内容{0}".format("abc")
print(s5)

s6 = "{{0}}位置的内容为{0}".format("abc")
print(s6)

print("*" * 50)
a = 1
b = 2
c = 3
print(f"{a},{b},{c}")
print(f"{a=},{b=},{c=}")

# 嵌套括号 将不再有变量值填充的效果
print(f"{{a=}},{{b=}},{{c=}}")
