"""
    str 字符串的使用
    字符串是不可变的、有序的
    字符串中的元素不可修改
    字符串使用单引号、双引号或三重引号定义
    字符串中每个值都有对应的位置值，成为索引或下标，索引从起始从0开始向后逐个递，并且从末尾从-1开始逐个向前递减
"""

print("------------------字符串的访问-------------------")

s1 ="hello world"

print(s1)
print(s1[0])
print(s1[-1])
print(s1[1:3])
print(s1[4:-3])

print("------------------字符串的加法-------------------")

s1 ="hello world"
s2 ="hello world"

print(s1 + s2)

print("------------------字符串的乘法-------------------")

print(s2 * 2)

print("------------------字符串的成员运算符-------------------")

print("h" in s2)
print("x" in s2)

print("------------------原始字符串-------------------")
# 在字符串前 加上R或者r 都可以保留原始的字符串
s1 = r"hello \n world"
print(s1)

s1 = R"hello \n world"
print(s1)

