"""
    列表操作
"""

list1 = [1, 2, 3, 4, 5]
list2 = ["a", "b", "c", "d"]
print(list1 + list2) # 内容拼接到一起

print(list1 * 2) # 每个元素复制一份

print(list2 * 3) # 每个元素复制对应的份数

print("------------------------------------------")

list1 = [1, 2, 3, 4, 5]

list1[0] = 100 # 直接指定下标修改元素

print(list1)

print("------------------------------------------")

list1 = [1, 2, 3, 4, 5]

list1[1:3] = [666] # 将指定范围的数据改为单个数据 注意：必须用中括号包括

print(list1)

print("------------------------------------------")

list1 = [1, 2, 3, 4, 5]

list1[1:3] = [11,22,44,66,78] # 将指定范围的数据改为多个数据

print(list1)

print("------------------------------------------")

list1 = [1, 2, 3, 4, 5]

list1[1:3] = ["a","b","hello world"] # 将指定范围的数据改为多个数据 可以是不同的类型

print(list1)